parsing-tech-log/src/InformationRegisters/Журнал/Журнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Журнал</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗначениеСвойств</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Замер</name>
    <type>
      <types>CatalogRef.Замеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>CatalogRef.Процессы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцессID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодФайла</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоляПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

parsing-tech-log/src/InformationRegisters/СвойстваСобытия/СвойстваСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваСобытия</name>
  <attributes>
    <name>ЗначениеСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Замер</name>
    <type>
      <types>CatalogRef.Замеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>CatalogRef.Свойства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>CatalogRef.Процессы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцессID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодФайла</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

parsing-tech-log/src/InformationRegisters/Журнал/ManagerModule.bsl
Процедура ЗаписатьСобытие(СтруктураЗаписи) Экспорт
	//запись выполняется одновременно для события журнала и свойств - событие менеджером записи, свойства набором
	//см. ОбновлениеДанных.ПолучитьСтруктуруЗаписиЖурнала()
	
	НачатьТранзакцию();
	
	МенеджерЗаписи = РегистрыСведений.Журнал.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи, "Замер,Процесс,ПроцессID,ПериодФайла,ПериодСобытия,ДоляПериода,Событие,КлючСобытия,Длительность,Уровень,ЗначениеСвойств");
	МенеджерЗаписи.Записать();

	КлючевыеПоля = "Замер,Процесс,ПроцессID,ПериодФайла,ПериодСобытия,КлючСобытия";
	КлючевыеПоляМассив = СтрРазделить(КлючевыеПоля, ",");
	НаборЗаписейСвойства = РегистрыСведений.СвойстваСобытия.СоздатьНаборЗаписей();
	Для Каждого ИмяИзмерения Из КлючевыеПоляМассив Цикл
		НаборЗаписейСвойства.Отбор[ИмяИзмерения].Установить(СтруктураЗаписи[ИмяИзмерения]);
	КонецЦикла;
	Для Каждого СтрокаСвойства Из СтруктураЗаписи.Свойства Цикл
		ЗаписьСвойства = НаборЗаписейСвойства.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьСвойства, СтруктураЗаписи, КлючевыеПоля);
		ЗаписьСвойства.Свойство = СтрокаСвойства.Ключ;
		ЗаписьСвойства.ЗначениеСвойства = СтрокаСвойства.Значение; 
	КонецЦикла;
	НаборЗаписейСвойства.Записать();
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры
